app/controllers/favorites_controller.rb

INSERT INTO "favorites" ("created_at", "movie_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2015-01-23 20:12:08.157051"], ["movie_id", 7], ["updated_at", "2015-01-23 20:12:08.157051"], ["user_id", 6]]
---
	def create
		@movie.favorites.create!(user: current_user)

SELECT  "favorites".* FROM "favorites"  WHERE "favorites"."user_id" = ? AND "favorites"."id" = ? LIMIT 1  [["user_id", 6], ["id", 9]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 9]]
---
	def destroy
		favorite = current_user.favorites.find(params[:id])
		favorite.destroy