app/controllers/movies_controller.rb

SELECT  "favorites".* FROM "favorites"  WHERE "favorites"."user_id" = ? AND "favorites"."movie_id" = 7 LIMIT 1  [["user_id", 6]]
SELECT "genres".* FROM "genres" INNER JOIN "characterizations" ON "genres"."id" = "characterizations"."genre_id" WHERE "characterizations"."movie_id" = ?  [["movie_id", 7]]
---
  def show
    @fans = @movie.fans
    @genres = @movie.genres

    if current_user
      @current_fave = current_user.favorites.find_by(movie_id: @movie.id)

SELECT  "movies".* FROM "movies"  WHERE "movies"."slug" = 'batman-vs-godzilla' LIMIT 1
---
  def set_movie
    @movie = Movie.find_by!(slug: params[:id])