app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("comment", "created_at", "movie_id", "stars", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["comment", "Woof woof woof. "], ["created_at", "2015-01-20 02:55:09.415013"], ["movie_id", 6], ["stars", 5], ["updated_at", "2015-01-20 02:55:09.415013"], ["user_id", 7]]
---
  def create
    @review = @movie.reviews.new(review_params)
    @review.user = current_user
    if @review.save